app/controllers/forecasts_controller.rb

  def index
    @forecasts = Forecast.all
---
SELECT "forecasts".* FROM "forecasts"

  def create
    @forecast = Forecast.new(forecast_params)

    respond_to do |format|
      if @forecast.save
---
INSERT INTO "forecasts" ("latitude", "longitude", "summary", "temperature", "windSpeed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["latitude", 1.5], ["longitude", 1.5], ["summary", "MyString"], ["temperature", 1.5], ["windSpeed", 1.5], ["created_at", "2016-11-29 13:56:12.373035"], ["updated_at", "2016-11-29 13:56:12.373035"]]

  def destroy
    @forecast.destroy
---
DELETE FROM "forecasts" WHERE "forecasts"."id" = ?  [["id", 980190962]]

    def set_forecast
      @forecast = Forecast.find(params[:id])
---
SELECT  "forecasts".* FROM "forecasts"  WHERE "forecasts"."id" = ? LIMIT 1  [["id", 980190962]]